Reports/Load_HTML_Report/statistics.json
{
  "POST addtocart " : {
    "transaction" : "POST addtocart ",
    "sampleCount" : 125,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 364.92000000000013,
    "medianResTime" : 333.0,
    "minResTime" : 263.0,
    "maxResTime" : 745.0,
    "pct1ResTime" : 529.6,
    "pct2ResTime" : 564.9999999999998,
    "pct3ResTime" : 726.0199999999996,
    "throughput" : 0.8753378804218429,
    "receivedKBytesPerSec" : 0.22738269159395527,
    "sentKBytesPerSec" : 0.19148016134227813
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 625,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 720.4479999999992,
    "medianResTime" : 416.0,
    "minResTime" : 263.0,
    "maxResTime" : 3334.0,
    "pct1ResTime" : 1884.9999999999998,
    "pct2ResTime" : 2180.8999999999987,
    "pct3ResTime" : 2503.48,
    "throughput" : 3.7331931643739886,
    "receivedKBytesPerSec" : 64.96702237153336,
    "sentKBytesPerSec" : 0.7266368838738001
  },
  "GET /entries (browse products)" : {
    "transaction" : "GET /entries (browse products)",
    "sampleCount" : 125,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 492.5680000000001,
    "medianResTime" : 422.0,
    "minResTime" : 294.0,
    "maxResTime" : 2022.0,
    "pct1ResTime" : 663.6,
    "pct2ResTime" : 825.0999999999992,
    "pct3ResTime" : 1858.1999999999966,
    "throughput" : 0.8671161796942202,
    "receivedKBytesPerSec" : 2.4819507057458585,
    "sentKBytesPerSec" : 0.13464010993298925
  },
  "POST /viewcart" : {
    "transaction" : "POST /viewcart",
    "sampleCount" : 125,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1912.064,
    "medianResTime" : 1880.0,
    "minResTime" : 1073.0,
    "maxResTime" : 3334.0,
    "pct1ResTime" : 2425.2000000000003,
    "pct2ResTime" : 2503.4,
    "pct3ResTime" : 3327.24,
    "throughput" : 0.8639756704451202,
    "receivedKBytesPerSec" : 71.85339385842894,
    "sentKBytesPerSec" : 0.16368289068979816
  },
  "GET /prod?id=1 (view product)" : {
    "transaction" : "GET /prod?id=1 (view product)",
    "sampleCount" : 125,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 422.5439999999999,
    "medianResTime" : 386.0,
    "minResTime" : 279.0,
    "maxResTime" : 792.0,
    "pct1ResTime" : 584.4000000000001,
    "pct2ResTime" : 669.0999999999999,
    "pct3ResTime" : 782.6399999999999,
    "throughput" : 0.8747620647183966,
    "receivedKBytesPerSec" : 0.4220043554403203,
    "sentKBytesPerSec" : 0.16060084781939313
  },
  "POST /login" : {
    "transaction" : "POST /login",
    "sampleCount" : 125,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 410.1440000000001,
    "medianResTime" : 370.0,
    "minResTime" : 278.0,
    "maxResTime" : 831.0,
    "pct1ResTime" : 595.4000000000001,
    "pct2ResTime" : 684.3,
    "pct3ResTime" : 806.2999999999995,
    "throughput" : 0.8707403382652066,
    "receivedKBytesPerSec" : 0.2108824256736047,
    "sentKBytesPerSec" : 0.19690976430800522
  }
}