Reports/Soak_HTML_Report/statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 4726,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 572.6396529834955,
    "medianResTime" : 398.5,
    "minResTime" : 265.0,
    "maxResTime" : 3671.0,
    "pct1ResTime" : 1083.0,
    "pct2ResTime" : 1357.2999999999993,
    "pct3ResTime" : 2053.679999999993,
    "throughput" : 2.6329893621881335,
    "receivedKBytesPerSec" : 49.1611920955442,
    "sentKBytesPerSec" : 0.5123172104867744
  },
  "GET /entries (browse products)" : {
    "transaction" : "GET /entries (browse products)",
    "sampleCount" : 952,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 458.324579831933,
    "medianResTime" : 360.5,
    "minResTime" : 287.0,
    "maxResTime" : 1831.0,
    "pct1ResTime" : 703.0,
    "pct2ResTime" : 920.9499999999985,
    "pct3ResTime" : 1461.5600000000013,
    "throughput" : 0.5308859047004036,
    "receivedKBytesPerSec" : 1.5195898885474193,
    "sentKBytesPerSec" : 0.08243247934312907
  },
  "POST /view (view product)" : {
    "transaction" : "POST /view (view product)",
    "sampleCount" : 947,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 438.3790918690601,
    "medianResTime" : 338.0,
    "minResTime" : 274.0,
    "maxResTime" : 1854.0,
    "pct1ResTime" : 693.4000000000001,
    "pct2ResTime" : 858.1999999999998,
    "pct3ResTime" : 1282.3199999999997,
    "throughput" : 0.5311463787819641,
    "receivedKBytesPerSec" : 0.25624539558626896,
    "sentKBytesPerSec" : 0.09751515547950124
  },
  "POST /viewcart" : {
    "transaction" : "POST /viewcart",
    "sampleCount" : 939,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1110.0841320553793,
    "medianResTime" : 987.0,
    "minResTime" : 577.0,
    "maxResTime" : 3671.0,
    "pct1ResTime" : 1729.0,
    "pct2ResTime" : 2029.0,
    "pct3ResTime" : 2604.4,
    "throughput" : 0.5296840228909241,
    "receivedKBytesPerSec" : 47.71360907880671,
    "sentKBytesPerSec" : 0.10035029339925708
  },
  "POST addtocart (item 1)" : {
    "transaction" : "POST addtocart (item 1)",
    "sampleCount" : 943,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 416.38069989395535,
    "medianResTime" : 313.0,
    "minResTime" : 265.0,
    "maxResTime" : 2771.0,
    "pct1ResTime" : 646.0,
    "pct2ResTime" : 821.9999999999998,
    "pct3ResTime" : 1373.12,
    "throughput" : 0.5314187980242266,
    "receivedKBytesPerSec" : 0.13807295350226403,
    "sentKBytesPerSec" : 0.11624786206779958
  },
  "POST /login" : {
    "transaction" : "POST /login",
    "sampleCount" : 945,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 444.24232804232815,
    "medianResTime" : 339.0,
    "minResTime" : 277.0,
    "maxResTime" : 2531.0,
    "pct1ResTime" : 706.1999999999999,
    "pct2ResTime" : 897.0999999999998,
    "pct3ResTime" : 1417.0,
    "throughput" : 0.5309901589823869,
    "receivedKBytesPerSec" : 0.12862771282591276,
    "sentKBytesPerSec" : 0.1200802242899622
  }
}