Reports/Volume_HTML_Report/statistics.json
{
  "POST addtocart (item 18)" : {
    "transaction" : "POST addtocart (item 18)",
    "sampleCount" : 16,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 518.3125,
    "medianResTime" : 534.5,
    "minResTime" : 276.0,
    "maxResTime" : 882.0,
    "pct1ResTime" : 674.1000000000003,
    "pct2ResTime" : 882.0,
    "pct3ResTime" : 882.0,
    "throughput" : 0.040166490101470595,
    "receivedKBytesPerSec" : 0.010443679677262252,
    "sentKBytesPerSec" : 0.008786419709696694
  },
  "POST addtocart (item 16)" : {
    "transaction" : "POST addtocart (item 16)",
    "sampleCount" : 16,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 300.875,
    "medianResTime" : 288.5,
    "minResTime" : 261.0,
    "maxResTime" : 514.0,
    "pct1ResTime" : 372.60000000000014,
    "pct2ResTime" : 514.0,
    "pct3ResTime" : 514.0,
    "throughput" : 0.04022586825022501,
    "receivedKBytesPerSec" : 0.01047876011303469,
    "sentKBytesPerSec" : 0.008799408679736722
  },
  "POST addtocart (item 14)" : {
    "transaction" : "POST addtocart (item 14)",
    "sampleCount" : 16,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 581.5,
    "medianResTime" : 553.0,
    "minResTime" : 288.0,
    "maxResTime" : 1211.0,
    "pct1ResTime" : 927.5000000000002,
    "pct2ResTime" : 1211.0,
    "pct3ResTime" : 1211.0,
    "throughput" : 0.04014865037802464,
    "receivedKBytesPerSec" : 0.010429239258354055,
    "sentKBytesPerSec" : 0.008782517270192889
  },
  "POST addtocart (item 2)" : {
    "transaction" : "POST addtocart (item 2)",
    "sampleCount" : 16,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 589.4375,
    "medianResTime" : 571.0,
    "minResTime" : 298.0,
    "maxResTime" : 1107.0,
    "pct1ResTime" : 799.7000000000003,
    "pct2ResTime" : 1107.0,
    "pct3ResTime" : 1107.0,
    "throughput" : 0.04014562826653686,
    "receivedKBytesPerSec" : 0.010428454217674615,
    "sentKBytesPerSec" : 0.008781856183304938
  },
  "POST addtocart (item 12)" : {
    "transaction" : "POST addtocart (item 12)",
    "sampleCount" : 16,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 297.75000000000006,
    "medianResTime" : 303.5,
    "minResTime" : 265.0,
    "maxResTime" : 316.0,
    "pct1ResTime" : 313.9,
    "pct2ResTime" : 316.0,
    "pct3ResTime" : 316.0,
    "throughput" : 0.04000240014400864,
    "receivedKBytesPerSec" : 0.010410780896853811,
    "sentKBytesPerSec" : 0.00875052503150189
  },
  "POST /login" : {
    "transaction" : "POST /login",
    "sampleCount" : 16,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 446.31250000000006,
    "medianResTime" : 354.5,
    "minResTime" : 277.0,
    "maxResTime" : 771.0,
    "pct1ResTime" : 723.4000000000001,
    "pct2ResTime" : 771.0,
    "pct3ResTime" : 771.0,
    "throughput" : 0.04054595123335716,
    "receivedKBytesPerSec" : 0.009819722564328686,
    "sentKBytesPerSec" : 0.009163919520087986
  },
  "POST addtocart (item 5)" : {
    "transaction" : "POST addtocart (item 5)",
    "sampleCount" : 16,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 367.9375,
    "medianResTime" : 318.5,
    "minResTime" : 278.0,
    "maxResTime" : 748.0,
    "pct1ResTime" : 566.7000000000002,
    "pct2ResTime" : 748.0,
    "pct3ResTime" : 748.0,
    "throughput" : 0.039988703191348444,
    "receivedKBytesPerSec" : 0.010397453344430199,
    "sentKBytesPerSec" : 0.008747528823107472
  },
  "POST addtocart (item 11)" : {
    "transaction" : "POST addtocart (item 11)",
    "sampleCount" : 16,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 359.125,
    "medianResTime" : 303.0,
    "minResTime" : 285.0,
    "maxResTime" : 724.0,
    "pct1ResTime" : 630.2,
    "pct2ResTime" : 724.0,
    "pct3ResTime" : 724.0,
    "throughput" : 0.039934906103052024,
    "receivedKBytesPerSec" : 0.01038346557611094,
    "sentKBytesPerSec" : 0.008735760710042631
  },
  "POST addtocart (item 3)" : {
    "transaction" : "POST addtocart (item 3)",
    "sampleCount" : 16,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 365.0,
    "medianResTime" : 337.5,
    "minResTime" : 265.0,
    "maxResTime" : 668.0,
    "pct1ResTime" : 593.8000000000001,
    "pct2ResTime" : 668.0,
    "pct3ResTime" : 668.0,
    "throughput" : 0.04017526459178165,
    "receivedKBytesPerSec" : 0.01043615271622453,
    "sentKBytesPerSec" : 0.008788339129452236
  },
  "POST addtocart (item 9)" : {
    "transaction" : "POST addtocart (item 9)",
    "sampleCount" : 16,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 289.6875,
    "medianResTime" : 284.5,
    "minResTime" : 267.0,
    "maxResTime" : 312.0,
    "pct1ResTime" : 311.3,
    "pct2ResTime" : 312.0,
    "pct3ResTime" : 312.0,
    "throughput" : 0.03984649139191266,
    "receivedKBytesPerSec" : 0.010350748740477311,
    "sentKBytesPerSec" : 0.008716419991980893
  },
  "POST addtocart (item 7)" : {
    "transaction" : "POST addtocart (item 7)",
    "sampleCount" : 16,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 362.68750000000006,
    "medianResTime" : 301.0,
    "minResTime" : 279.0,
    "maxResTime" : 595.0,
    "pct1ResTime" : 582.4,
    "pct2ResTime" : 595.0,
    "pct3ResTime" : 595.0,
    "throughput" : 0.03995684660566588,
    "receivedKBytesPerSec" : 0.010389170321053262,
    "sentKBytesPerSec" : 0.008740560194989411
  },
  "POST /viewcart" : {
    "transaction" : "POST /viewcart",
    "sampleCount" : 16,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1619.6875,
    "medianResTime" : 1667.5,
    "minResTime" : 948.0,
    "maxResTime" : 2418.0,
    "pct1ResTime" : 2307.4,
    "pct2ResTime" : 2418.0,
    "pct3ResTime" : 2418.0,
    "throughput" : 0.040126096257489155,
    "receivedKBytesPerSec" : 3.4084454147157444,
    "sentKBytesPerSec" : 0.0076020143300321264
  },
  "POST /view (view product)" : {
    "transaction" : "POST /view (view product)",
    "sampleCount" : 16,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 347.6875,
    "medianResTime" : 314.5,
    "minResTime" : 283.0,
    "maxResTime" : 608.0,
    "pct1ResTime" : 495.3000000000001,
    "pct2ResTime" : 608.0,
    "pct3ResTime" : 608.0,
    "throughput" : 0.04024266325945451,
    "receivedKBytesPerSec" : 0.019413941064619654,
    "sentKBytesPerSec" : 0.007388301457790476
  },
  "POST addtocart (item 19)" : {
    "transaction" : "POST addtocart (item 19)",
    "sampleCount" : 16,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 344.87499999999994,
    "medianResTime" : 295.0,
    "minResTime" : 276.0,
    "maxResTime" : 864.0,
    "pct1ResTime" : 656.1000000000003,
    "pct2ResTime" : 864.0,
    "pct3ResTime" : 864.0,
    "throughput" : 0.040187979273049686,
    "receivedKBytesPerSec" : 0.010449267071728007,
    "sentKBytesPerSec" : 0.008791120465979619
  },
  "POST addtocart (item 17)" : {
    "transaction" : "POST addtocart (item 17)",
    "sampleCount" : 16,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 282.6875,
    "medianResTime" : 284.5,
    "minResTime" : 262.0,
    "maxResTime" : 302.0,
    "pct1ResTime" : 296.4,
    "pct2ResTime" : 302.0,
    "pct3ResTime" : 302.0,
    "throughput" : 0.04043569460941646,
    "receivedKBytesPerSec" : 0.010503803482524198,
    "sentKBytesPerSec" : 0.00884530819580985
  },
  "POST addtocart (item 1)" : {
    "transaction" : "POST addtocart (item 1)",
    "sampleCount" : 16,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 898.0625000000002,
    "medianResTime" : 299.5,
    "minResTime" : 274.0,
    "maxResTime" : 4716.0,
    "pct1ResTime" : 3115.1000000000017,
    "pct2ResTime" : 4716.0,
    "pct3ResTime" : 4716.0,
    "throughput" : 0.04036724097476795,
    "receivedKBytesPerSec" : 0.010486021581336206,
    "sentKBytesPerSec" : 0.00883033396323049
  },
  "POST addtocart (item 15)" : {
    "transaction" : "POST addtocart (item 15)",
    "sampleCount" : 16,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 331.68749999999994,
    "medianResTime" : 292.5,
    "minResTime" : 274.0,
    "maxResTime" : 554.0,
    "pct1ResTime" : 540.7,
    "pct2ResTime" : 554.0,
    "pct3ResTime" : 554.0,
    "throughput" : 0.0401615498342081,
    "receivedKBytesPerSec" : 0.010432590093651713,
    "sentKBytesPerSec" : 0.008785339026233022
  },
  "POST addtocart (item 13)" : {
    "transaction" : "POST addtocart (item 13)",
    "sampleCount" : 16,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 297.9375,
    "medianResTime" : 298.0,
    "minResTime" : 277.0,
    "maxResTime" : 315.0,
    "pct1ResTime" : 315.0,
    "pct2ResTime" : 315.0,
    "pct3ResTime" : 315.0,
    "throughput" : 0.04018020823392918,
    "receivedKBytesPerSec" : 0.010437436904516758,
    "sentKBytesPerSec" : 0.008789420551172007
  },
  "POST addtocart (item 10)" : {
    "transaction" : "POST addtocart (item 10)",
    "sampleCount" : 16,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 507.62500000000006,
    "medianResTime" : 552.5,
    "minResTime" : 279.0,
    "maxResTime" : 587.0,
    "pct1ResTime" : 580.0,
    "pct2ResTime" : 587.0,
    "pct3ResTime" : 587.0,
    "throughput" : 0.03979535240028155,
    "receivedKBytesPerSec" : 0.010337464588354387,
    "sentKBytesPerSec" : 0.00870523333756159
  },
  "POST addtocart (item 6)" : {
    "transaction" : "POST addtocart (item 6)",
    "sampleCount" : 16,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 669.25,
    "medianResTime" : 579.5,
    "minResTime" : 274.0,
    "maxResTime" : 1331.0,
    "pct1ResTime" : 1307.2,
    "pct2ResTime" : 1331.0,
    "pct3ResTime" : 1331.0,
    "throughput" : 0.0399855052543453,
    "receivedKBytesPerSec" : 0.01038685976333579,
    "sentKBytesPerSec" : 0.008746829274388034
  },
  "POST addtocart (item 4)" : {
    "transaction" : "POST addtocart (item 4)",
    "sampleCount" : 16,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 342.00000000000006,
    "medianResTime" : 321.0,
    "minResTime" : 283.0,
    "maxResTime" : 440.0,
    "pct1ResTime" : 419.0,
    "pct2ResTime" : 440.0,
    "pct3ResTime" : 440.0,
    "throughput" : 0.040077248897249444,
    "receivedKBytesPerSec" : 0.010410691608074564,
    "sentKBytesPerSec" : 0.008766898196273317
  },
  "POST addtocart (item 20)" : {
    "transaction" : "POST addtocart (item 20)",
    "sampleCount" : 16,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 308.125,
    "medianResTime" : 291.0,
    "minResTime" : 287.0,
    "maxResTime" : 554.0,
    "pct1ResTime" : 379.00000000000017,
    "pct2ResTime" : 554.0,
    "pct3ResTime" : 554.0,
    "throughput" : 0.04031943068963866,
    "receivedKBytesPerSec" : 0.01048344572374638,
    "sentKBytesPerSec" : 0.008819875463358457
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 384,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 478.55729166666663,
    "medianResTime" : 309.0,
    "minResTime" : 261.0,
    "maxResTime" : 4716.0,
    "pct1ResTime" : 728.0,
    "pct2ResTime" : 1207.0,
    "pct3ResTime" : 2283.699999999996,
    "throughput" : 0.5025664919026592,
    "receivedKBytesPerSec" : 1.9627004703708262,
    "sentKBytesPerSec" : 0.10740963087210992
  },
  "GET /entries (browse products)" : {
    "transaction" : "GET /entries (browse products)",
    "sampleCount" : 16,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 729.25,
    "medianResTime" : 665.0,
    "minResTime" : 332.0,
    "maxResTime" : 1379.0,
    "pct1ResTime" : 1085.0000000000002,
    "pct2ResTime" : 1379.0,
    "pct3ResTime" : 1379.0,
    "throughput" : 0.04014421810353695,
    "receivedKBytesPerSec" : 0.11490498365377619,
    "sentKBytesPerSec" : 0.006233330740685914
  },
  "POST addtocart (item 8)" : {
    "transaction" : "POST addtocart (item 8)",
    "sampleCount" : 16,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 327.87500000000006,
    "medianResTime" : 299.0,
    "minResTime" : 278.0,
    "maxResTime" : 602.0,
    "pct1ResTime" : 546.0,
    "pct2ResTime" : 602.0,
    "pct3ResTime" : 602.0,
    "throughput" : 0.039816446183095926,
    "receivedKBytesPerSec" : 0.010352664840087199,
    "sentKBytesPerSec" : 0.008709847602552234
  }
}